{
    "0000": 639,
    "000100": 161,
    "000101": 160,
    "000110": 888,
    "0001110": 745,
    "0001111": 708,
    "001000": 73,
    "001001": 446,
    "0010100": 138,
    "001010100": 44,
    "001010101": 45,
    "001010110": 641,
    "001010111": 908,
    "00101100": 876,
    "00101101": 238,
    "00101110": 573,
    "0010111100": 321,
    "00101111010": 186,
    "001011110110": 494,
    "001011110111": 901,
    "001011111000": 808,
    "001011111001": 809,
    "001011111010": 87,
    "0010111110110": 697,
    "0010111110111": 439,
    "00101111110": 74,
    "001011111110": 255,
    "001011111111": 118,
    "0011000": 173,
    "0011001": 172,
    "0011010": 462,
    "00110110": 652,
    "001101110": 510,
    "0011011110": 410,
    "0011011111": 411,
    "00111000": 623,
    "00111001": 113,
    "001110100": 53,
    "0011101010": 874,
    "00111010110": 12,
    "00111010111": 11,
    "001110110": 305,
    "001110111": 306,
    "00111100": 152,
    "001111010": 233,
    "0011110110": 64,
    "0011110111": 65,
    "00111110": 440,
    "001111110": 526,
    "001111111": 525,
    "0100000": 789,
    "01000010": 720,
    "01000011": 721,
    "010001000": 691,
    "010001001": 628,
    "0100010100": 21,
    "01000101010": 822,
    "010001010110": 504,
    "010001010111": 503,
    "0100010110": 739,
    "010001011100": 971,
    "010001011101": 970,
    "0100010111100": 437,
    "01000101111010": 291,
    "01000101111011": 202,
    "0100010111110": 716,
    "0100010111111": 717,
    "010001100": 116,
    "0100011010": 618,
    "0100011011": 619,
    "010001110": 846,
    "01000111100": 947,
    "010001111010": 275,
    "010001111011": 276,
    "01000111110": 647,
    "010001111110": 58,
    "0100011111110": 182,
    "0100011111111": 181,
    "0100100": 515,
    "01001010": 211,
    "01001011": 210,
    "010011000": 878,
    "0100110010": 477,
    "0100110011": 771,
    "01001101000": 270,
    "01001101001": 269,
    "010011010100": 563,
    "010011010101": 562,
    "010011010110": 287,
    "010011010111": 288,
    "010011011000": 522,
    "010011011001": 521,
    "010011011010": 239,
    "010011011011": 240,
    "010011011100": 865,
    "010011011101": 866,
    "0100110111100": 33,
    "0100110111101": 34,
    "0100110111110": 524,
    "0100110111111": 748,
    "0100111000": 478,
    "01001110010": 847,
    "01001110011": 848,
    "0100111010": 608,
    "010011101100": 980,
    "010011101101": 983,
    "010011101110": 636,
    "010011101111": 646,
    "010011110": 468,
    "0100111110": 322,
    "01001111110": 810,
    "01001111111": 811,
    "01010000000": 544,
    "01010000001": 543,
    "010100000100": 699,
    "010100000101": 22,
    "010100000110": 360,
    "010100000111": 361,
    "01010000100": 229,
    "01010000101": 230,
    "01010000110": 984,
    "010100001110": 193,
    "010100001111": 192,
    "010100010": 13,
    "01010001100": 465,
    "01010001101": 464,
    "01010001110": 751,
    "01010001111": 532,
    "0101001000": 1,
    "01010010010": 560,
    "01010010011": 559,
    "0101001010": 616,
    "0101001011": 20,
    "0101001100": 385,
    "01010011010": 781,
    "01010011011": 782,
    "01010011100": 179,
    "01010011101": 180,
    "010100111100": 190,
    "010100111101": 864,
    "010100111110": 133,
    "010100111111": 132,
    "01010100000": 542,
    "010101000010": 97,
    "010101000011": 98,
    "01010100010": 895,
    "010101000110": 979,
    "010101000111": 978,
    "01010100100": 216,
    "010101001010": 75,
    "010101001011": 470,
    "01010100110": 508,
    "010101001110": 189,
    "0101010011110": 286,
    "01010100111110": 103,
    "01010100111111": 104,
    "01010101000": 260,
    "01010101001": 259,
    "01010101010": 531,
    "010101010110": 582,
    "010101010111": 245,
    "0101010110": 299,
    "010101011100": 763,
    "010101011101": 764,
    "010101011110": 284,
    "010101011111": 282,
    "010101100": 611,
    "010101101": 610,
    "010101110": 914,
    "0101011110": 625,
    "0101011111": 626,
    "0101100000": 96,
    "0101100001": 95,
    "0101100010": 821,
    "01011000110": 500,
    "01011000111": 501,
    "01011001000": 262,
    "010110010010": 835,
    "010110010011": 834,
    "01011001010": 528,
    "010110010110": 955,
    "010110010111": 956,
    "010110011000": 121,
    "0101100110010": 277,
    "01011001100110": 264,
    "01011001100111": 263,
    "010110011010": 849,
    "010110011011": 850,
    "010110011100": 436,
    "0101100111010": 204,
    "0101100111011": 295,
    "0101100111100": 666,
    "0101100111101": 667,
    "0101100111110": 423,
    "0101100111111": 418,
    "010110100": 37,
    "0101101010": 807,
    "0101101011": 800,
    "010110110": 597,
    "01011011100": 632,
    "01011011101": 428,
    "0101101111000": 455,
    "01011011110010": 792,
    "01011011110011": 793,
    "0101101111010": 176,
    "0101101111011": 671,
    "010110111110": 281,
    "01011011111100": 885,
    "01011011111101": 158,
    "01011011111110": 891,
    "01011011111111": 892,
    "0101110": 495,
    "0101111000": 17,
    "01011110010": 148,
    "01011110011": 147,
    "0101111010": 726,
    "0101111011": 727,
    "010111110": 63,
    "0101111110": 594,
    "01011111110": 251,
    "01011111111": 250,
    "011000000": 973,
    "011000001": 840,
    "011000010": 226,
    "0110000110": 394,
    "0110000111": 227,
    "011000100": 638,
    "0110001010": 692,
    "0110001011": 799,
    "011000110": 221,
    "0110001110": 819,
    "0110001111": 804,
    "0110010000": 5,
    "0110010001": 4,
    "0110010010": 329,
    "01100100110": 505,
    "011001001110": 175,
    "0110010011110": 649,
    "0110010011111": 823,
    "011001010": 312,
    "0110010110": 579,
    "0110010111": 566,
    "011001100": 591,
    "011001101": 933,
    "011001110": 200,
    "0110011110": 824,
    "0110011111": 825,
    "011010000": 38,
    "0110100010": 78,
    "011010001100": 995,
    "0110100011010": 396,
    "0110100011011": 66,
    "011010001110": 231,
    "0110100011110": 254,
    "0110100011111": 274,
    "0110100100": 659,
    "01101001010": 747,
    "01101001011": 752,
    "0110100110": 958,
    "0110100111": 957,
    "011010100": 119,
    "011010101": 654,
    "011010110": 715,
    "0110101110": 248,
    "01101011110": 724,
    "011010111110": 164,
    "0110101111110": 120,
    "01101011111110": 391,
    "01101011111111": 392,
    "01101100000": 962,
    "01101100001": 994,
    "011011000100": 402,
    "011011000101": 401,
    "011011000110": 122,
    "0110110001110": 127,
    "0110110001111": 128,
    "0110110010": 328,
    "01101100110": 389,
    "01101100111": 388,
    "011011010": 49,
    "0110110110": 466,
    "0110110111": 467,
    "011011100": 445,
    "0110111010": 658,
    "0110111011": 129,
    "011011110": 165,
    "011011111000": 737,
    "011011111001": 736,
    "011011111010": 453,
    "011011111011": 454,
    "0110111111000": 376,
    "0110111111001": 375,
    "01101111110100": 483,
    "01101111110101": 482,
    "01101111110110": 199,
    "011011111101110": 985,
    "011011111101111": 926,
    "0110111111100": 409,
    "01101111111010": 109,
    "01101111111011": 110,
    "0110111111110": 383,
    "01101111111110": 950,
    "01101111111111": 992,
    "01110000": 765,
    "011100010": 832,
    "011100011": 614,
    "01110010": 868,
    "011100110": 498,
    "0111001110": 968,
    "01110011110": 142,
    "011100111110": 484,
    "011100111111": 485,
    "01110100": 395,
    "011101010": 434,
    "011101011": 435,
    "01110110": 469,
    "01110111000": 62,
    "01110111001": 61,
    "01110111010": 325,
    "011101110110": 719,
    "011101110111": 598,
    "0111011110": 882,
    "01110111110": 461,
    "011101111110": 382,
    "011101111111": 381,
    "0111100000": 290,
    "01111000010": 307,
    "01111000011": 308,
    "01111000100": 725,
    "0111100010100": 474,
    "0111100010101": 473,
    "0111100010110": 568,
    "0111100010111": 570,
    "011110001100": 140,
    "011110001101": 141,
    "0111100011100": 236,
    "0111100011101": 237,
    "0111100011110": 944,
    "0111100011111": 661,
    "0111100100000": 334,
    "01111001000010": 246,
    "01111001000011": 247,
    "0111100100010": 69,
    "0111100100011": 68,
    "011110010010": 256,
    "0111100100110": 951,
    "0111100100111": 952,
    "011110010100": 875,
    "0111100101010": 130,
    "0111100101011": 50,
    "0111100101100": 731,
    "0111100101101": 735,
    "0111100101110": 71,
    "01111001011110": 331,
    "01111001011111": 330,
    "01111001100": 934,
    "011110011010": 228,
    "0111100110110": 359,
    "0111100110111": 358,
    "0111100111000": 589,
    "0111100111001": 676,
    "0111100111010": 123,
    "0111100111011": 311,
    "011110011110": 372,
    "0111100111110": 195,
    "0111100111111": 196,
    "011110100000": 487,
    "011110100001": 486,
    "011110100010": 571,
    "011110100011": 203,
    "01111010010": 539,
    "011110100110": 91,
    "011110100111": 90,
    "01111010100": 856,
    "011110101010": 644,
    "011110101011": 650,
    "011110101100": 663,
    "011110101101": 662,
    "011110101110": 390,
    "0111101011110": 794,
    "01111010111110": 356,
    "01111010111111": 357,
    "01111011000": 786,
    "011110110010": 991,
    "011110110011": 941,
    "01111011010": 67,
    "0111101101100": 433,
    "0111101101101": 432,
    "01111011011100": 514,
    "011110110111010": 169,
    "011110110111011": 168,
    "01111011011110": 620,
    "01111011011111": 621,
    "011110111000": 750,
    "0111101110010": 52,
    "0111101110011": 51,
    "011110111010": 471,
    "0111101110110": 929,
    "0111101110111": 574,
    "0111101111000": 943,
    "01111011110010": 355,
    "01111011110011": 354,
    "0111101111010": 974,
    "01111011110110": 480,
    "01111011110111": 481,
    "0111101111100": 362,
    "0111101111101": 363,
    "01111011111100": 990,
    "011110111111010": 788,
    "011110111111011": 744,
    "01111011111110": 235,
    "01111011111111": 234,
    "01111100": 144,
    "011111010": 695,
    "01111101100": 837,
    "011111011010": 569,
    "0111110110110": 553,
    "01111101101110": 606,
    "011111011011110": 734,
    "011111011011111": 460,
    "01111101110": 520,
    "011111011110": 869,
    "011111011111": 502,
    "0111111000": 101,
    "01111110010": 340,
    "01111110011": 749,
    "01111110100": 30,
    "011111101010": 220,
    "0111111010110": 728,
    "0111111010111": 729,
    "01111110110": 499,
    "01111110111": 742,
    "011111110": 496,
    "0111111110": 46,
    "01111111110": 552,
    "0111111111100": 657,
    "0111111111101": 656,
    "0111111111110": 954,
    "01111111111110": 244,
    "01111111111111": 655,
    "100000": 201,
    "100001": 197,
    "1000100": 604,
    "10001010": 541,
    "10001011": 540,
    "10001100": 976,
    "10001101": 975,
    "10001110": 194,
    "10001111": 198,
    "10010": 406,
    "1001100": 627,
    "10011010": 125,
    "100110110": 702,
    "100110111": 703,
    "100111000": 600,
    "1001110010": 757,
    "1001110011": 756,
    "100111010": 899,
    "1001110110": 883,
    "1001110111": 884,
    "10011110": 15,
    "10011111": 14,
    "1010": 88,
    "10110": 272,
    "1011100": 404,
    "1011101000": 449,
    "1011101001": 732,
    "1011101010": 451,
    "1011101011": 452,
    "101110110": 326,
    "1011101110": 317,
    "101110111100": 909,
    "101110111101": 910,
    "101110111110": 178,
    "10111011111100": 2,
    "10111011111101": 3,
    "10111011111110": 258,
    "10111011111111": 257,
    "10111100": 685,
    "10111101": 684,
    "10111110": 407,
    "10111111": 408,
    "11000": 108,
    "11001": 107,
    "110100": 674,
    "110101": 673,
    "110110": 403,
    "11011100": 422,
    "11011101": 421,
    "11011110": 92,
    "110111110": 54,
    "110111111": 57,
    "111000000": 185,
    "1110000010": 39,
    "1110000011": 40,
    "1110000100": 881,
    "11100001010": 296,
    "111000010110": 412,
    "111000010111": 413,
    "11100001100": 712,
    "11100001101": 915,
    "11100001110": 429,
    "111000011110": 163,
    "111000011111": 162,
    "11100010": 989,
    "1110001100": 416,
    "11100011010": 572,
    "11100011011": 596,
    "11100011100": 184,
    "11100011101": 183,
    "11100011110": 854,
    "111000111110": 8,
    "111000111111": 889,
    "11100100": 554,
    "1110010100": 690,
    "1110010101": 689,
    "11100101100": 828,
    "11100101101": 827,
    "11100101110": 590,
    "11100101111000": 806,
    "11100101111001": 845,
    "11100101111010": 81,
    "11100101111011": 80,
    "1110010111110": 267,
    "1110010111111": 268,
    "111001100000": 977,
    "111001100001": 831,
    "111001100010": 516,
    "111001100011": 517,
    "11100110010": 25,
    "1110011001100": 686,
    "1110011001101": 605,
    "1110011001110": 489,
    "1110011001111": 488,
    "11100110100": 530,
    "11100110101": 529,
    "11100110110": 843,
    "111001101110": 872,
    "111001101111": 877,
    "111001110": 29,
    "111001111": 28,
    "1110100": 405,
    "11101010000": 117,
    "111010100010": 298,
    "111010100011": 942,
    "111010100100": 917,
    "111010100101": 960,
    "111010100110": 187,
    "11101010011100": 476,
    "111010100111010": 399,
    "111010100111011": 400,
    "11101010011110": 588,
    "11101010011111": 584,
    "111010101000": 16,
    "1110101010010": 880,
    "11101010100110": 419,
    "11101010100111": 420,
    "1110101010100": 265,
    "1110101010101": 266,
    "1110101010110": 7,
    "11101010101110": 215,
    "111010101011110": 713,
    "111010101011111": 261,
    "11101010110": 863,
    "11101010111000": 758,
    "11101010111001": 759,
    "111010101110100": 665,
    "111010101110101": 249,
    "111010101110110": 938,
    "111010101110111": 937,
    "1110101011110": 778,
    "1110101011111": 779,
    "111010110000": 900,
    "111010110001": 904,
    "1110101100100": 523,
    "11101011001010": 511,
    "11101011001011": 512,
    "1110101100110": 242,
    "1110101100111": 241,
    "111010110100": 150,
    "111010110101": 149,
    "111010110110": 886,
    "11101011011100": 444,
    "11101011011101": 443,
    "111010110111100": 743,
    "1110101101111010": 855,
    "1110101101111011": 853,
    "111010110111110": 870,
    "1110101101111110": 935,
    "1110101101111111": 936,
    "11101011100000": 912,
    "11101011100001": 911,
    "111010111000100": 803,
    "111010111000101": 802,
    "111010111000110": 76,
    "111010111000111": 77,
    "1110101110010": 894,
    "111010111001100": 777,
    "111010111001101": 509,
    "111010111001110": 730,
    "111010111001111": 283,
    "111010111010": 780,
    "1110101110110": 624,
    "11101011101110": 740,
    "11101011101111": 741,
    "111010111100": 370,
    "11101011110100": 351,
    "11101011110101": 350,
    "11101011110110": 86,
    "11101011110111": 518,
    "1110101111100": 753,
    "1110101111101": 668,
    "1110101111110": 998,
    "111010111111100": 124,
    "1110101111111010": 156,
    "1110101111111011": 157,
    "1110101111111100": 754,
    "1110101111111101": 755,
    "1110101111111110": 273,
    "1110101111111111": 41,
    "1110110": 519,
    "11101110": 84,
    "11101111": 85,
    "111100000000": 188,
    "111100000001": 839,
    "111100000010": 218,
    "111100000011": 217,
    "11110000010": 798,
    "111100000110": 348,
    "111100000111": 349,
    "1111000010": 219,
    "11110000110": 918,
    "111100001110": 60,
    "111100001111": 59,
    "11110001000": 93,
    "11110001001": 94,
    "11110001010": 919,
    "11110001011": 818,
    "1111000110": 343,
    "111100011100": 963,
    "1111000111010": 159,
    "1111000111011": 56,
    "1111000111100": 762,
    "1111000111101": 761,
    "1111000111110": 47,
    "1111000111111": 48,
    "11110010000": 612,
    "11110010001": 613,
    "111100100100": 386,
    "111100100101": 387,
    "1111001001100": 769,
    "1111001001101": 773,
    "1111001001110": 10,
    "11110010011110": 784,
    "11110010011111": 783,
    "111100101000": 424,
    "111100101001": 425,
    "111100101010": 705,
    "111100101011": 704,
    "1111001011000": 441,
    "11110010110010": 313,
    "11110010110011": 26,
    "11110010110100": 577,
    "11110010110101": 139,
    "111100101101100": 102,
    "1111001011011010": 920,
    "1111001011011011": 921,
    "111100101101110": 961,
    "1111001011011110": 791,
    "1111001011011111": 790,
    "1111001011100": 760,
    "11110010111010": 225,
    "11110010111011": 224,
    "1111001011110": 664,
    "11110010111110": 364,
    "11110010111111": 365,
    "111100110000": 680,
    "111100110001": 681,
    "1111001100100": 996,
    "1111001100101": 844,
    "1111001100110": 143,
    "1111001100111": 243,
    "111100110100": 371,
    "1111001101010": 586,
    "1111001101011": 585,
    "1111001101100": 191,
    "11110011011010": 43,
    "11110011011011": 6,
    "11110011011100": 456,
    "111100110111010": 345,
    "111100110111011": 344,
    "111100110111100": 965,
    "111100110111101": 964,
    "111100110111110": 214,
    "1111001101111110": 458,
    "1111001101111111": 459,
    "111100111000": 527,
    "111100111001": 320,
    "111100111010": 0,
    "1111001110110": 206,
    "11110011101110": 548,
    "11110011101111": 549,
    "1111001111000": 42,
    "11110011110010": 953,
    "111100111100110": 795,
    "111100111100111": 852,
    "11110011110100": 115,
    "11110011110101": 114,
    "11110011110110": 669,
    "11110011110111": 775,
    "1111001111100": 718,
    "111100111110100": 999,
    "1111001111101010": 767,
    "1111001111101011": 766,
    "1111001111101100": 167,
    "1111001111101101": 166,
    "1111001111101110": 896,
    "1111001111101111": 897,
    "1111001111110": 442,
    "11110011111110": 593,
    "1111001111111100": 278,
    "1111001111111101": 279,
    "1111001111111110": 551,
    "1111001111111111": 550,
    "1111010000": 615,
    "11110100010": 916,
    "11110100011": 145,
    "1111010010": 928,
    "11110100110": 787,
    "111101001110": 134,
    "111101001111": 135,
    "1111010100": 556,
    "1111010101000": 490,
    "1111010101001": 491,
    "1111010101010": 207,
    "1111010101011": 337,
    "1111010101100": 826,
    "11110101011010": 79,
    "11110101011011": 966,
    "1111010101110": 99,
    "11110101011110": 82,
    "11110101011111": 83,
    "111101011000": 576,
    "111101011001": 575,
    "11110101101000": 70,
    "11110101101001": 479,
    "11110101101010": 333,
    "11110101101011": 332,
    "1111010110110": 842,
    "11110101101110": 867,
    "11110101101111": 949,
    "111101011100": 923,
    "111101011101": 924,
    "1111010111100": 327,
    "11110101111010": 595,
    "11110101111011": 714,
    "1111010111110": 820,
    "11110101111110": 993,
    "11110101111111": 988,
    "11110110000": 902,
    "111101100010": 946,
    "111101100011": 945,
    "11110110010": 472,
    "1111011001100": 683,
    "1111011001101": 682,
    "1111011001110": 981,
    "1111011001111": 982,
    "1111011010": 986,
    "111101101100": 722,
    "111101101101": 723,
    "1111011011100": 830,
    "1111011011101": 833,
    "1111011011110": 24,
    "1111011011111": 23,
    "1111011100000": 812,
    "11110111000010": 642,
    "11110111000011": 643,
    "11110111000100": 630,
    "11110111000101": 314,
    "11110111000110": 693,
    "111101110001110": 711,
    "111101110001111": 710,
    "11110111001000": 913,
    "11110111001001": 927,
    "11110111001010": 640,
    "11110111001011": 948,
    "11110111001100": 738,
    "111101110011010": 862,
    "111101110011011": 861,
    "11110111001110": 774,
    "111101110011110": 537,
    "111101110011111": 538,
    "1111011101000": 137,
    "11110111010010": 497,
    "111101110100110": 324,
    "111101110100111": 323,
    "11110111010100": 297,
    "11110111010101": 930,
    "11110111010110": 36,
    "111101110101110": 801,
    "111101110101111": 89,
    "11110111011000": 205,
    "11110111011001": 294,
    "111101110110100": 617,
    "111101110110101": 841,
    "111101110110110": 922,
    "1111011101101110": 768,
    "1111011101101111": 339,
    "111101110111000": 733,
    "1111011101110010": 374,
    "1111011101110011": 373,
    "111101110111010": 18,
    "111101110111011": 19,
    "111101110111100": 415,
    "1111011101111010": 368,
    "1111011101111011": 369,
    "111101110111110": 131,
    "1111011101111110": 223,
    "1111011101111111": 222,
    "111101111000": 271,
    "1111011110010": 607,
    "11110111100110": 450,
    "111101111001110": 851,
    "111101111001111": 545,
    "1111011110100": 393,
    "11110111101010": 338,
    "111101111010110": 564,
    "111101111010111": 565,
    "11110111101100": 959,
    "111101111011010": 678,
    "111101111011011": 679,
    "1111011110111000": 342,
    "1111011110111001": 55,
    "1111011110111010": 772,
    "1111011110111011": 153,
    "1111011110111100": 346,
    "1111011110111101": 347,
    "1111011110111110": 677,
    "1111011110111111": 631,
    "11110111110000": 836,
    "111101111100010": 701,
    "111101111100011": 700,
    "111101111100100": 302,
    "111101111100101": 301,
    "111101111100110": 581,
    "111101111100111": 645,
    "111101111101000": 567,
    "1111011111010010": 293,
    "1111011111010011": 292,
    "111101111101010": 694,
    "1111011111010110": 430,
    "1111011111010111": 431,
    "11110111110110": 146,
    "111101111101110": 838,
    "1111011111011110": 209,
    "1111011111011111": 208,
    "11110111111000": 987,
    "111101111110010": 907,
    "1111011111100110": 859,
    "1111011111100111": 860,
    "111101111110100": 289,
    "111101111110101": 887,
    "111101111110110": 32,
    "111101111110111": 31,
    "1111011111110": 557,
    "11110111111110": 377,
    "11110111111111": 378,
    "11111000000": 770,
    "11111000001": 151,
    "11111000010": 906,
    "111110000110": 555,
    "1111100001110": 493,
    "1111100001111": 492,
    "11111000100": 648,
    "111110001010": 688,
    "111110001011": 687,
    "111110001100": 106,
    "111110001101": 105,
    "1111100011100": 253,
    "1111100011101": 252,
    "1111100011110": 599,
    "11111000111110": 341,
    "11111000111111": 651,
    "11111001000": 601,
    "1111100100100": 675,
    "11111001001010": 633,
    "11111001001011": 634,
    "1111100100110": 463,
    "11111001001110": 507,
    "11111001001111": 506,
    "11111001010": 903,
    "111110010110": 609,
    "1111100101110": 174,
    "11111001011110": 635,
    "11111001011111": 475,
    "1111100110": 660,
    "11111001110": 9,
    "111110011110": 785,
    "1111100111110": 932,
    "1111100111111": 931,
    "1111101000": 426,
    "1111101001": 427,
    "1111101010": 707,
    "1111101011": 706,
    "1111101100": 171,
    "1111101101": 170,
    "1111101110": 898,
    "1111101111000": 72,
    "1111101111001": 448,
    "1111101111010": 797,
    "1111101111011": 796,
    "1111101111100": 380,
    "1111101111101": 379,
    "1111101111110": 925,
    "11111011111110": 813,
    "11111011111111": 814,
    "11111100000": 285,
    "111111000010": 578,
    "111111000011": 232,
    "111111000100": 35,
    "1111110001010": 997,
    "11111100010110": 535,
    "11111100010111": 534,
    "1111110001100": 558,
    "11111100011010": 653,
    "11111100011011": 27,
    "11111100011100": 457,
    "11111100011101": 438,
    "111111000111100": 398,
    "111111000111101": 397,
    "111111000111110": 890,
    "111111000111111": 672,
    "111111001000": 533,
    "1111110010010": 280,
    "1111110010011": 698,
    "1111110010100": 304,
    "1111110010101": 303,
    "1111110010110": 637,
    "1111110010111": 580,
    "1111110011000": 561,
    "1111110011001": 417,
    "1111110011010": 696,
    "11111100110110": 815,
    "11111100110111": 829,
    "1111110011100": 111,
    "1111110011101": 112,
    "11111100111100": 939,
    "11111100111101": 940,
    "11111100111110": 893,
    "11111100111111": 879,
    "111111010000": 353,
    "111111010001": 352,
    "111111010010": 513,
    "1111110100110": 154,
    "1111110100111": 155,
    "111111010100": 602,
    "111111010101": 603,
    "111111010110": 969,
    "1111110101110": 384,
    "11111101011110": 905,
    "111111010111110": 367,
    "111111010111111": 366,
    "1111110110": 100,
    "1111110111000": 629,
    "1111110111001": 414,
    "11111101110100": 972,
    "111111011101010": 309,
    "111111011101011": 310,
    "11111101110110": 583,
    "111111011101110": 447,
    "1111110111011110": 136,
    "1111110111011111": 177,
    "1111110111100": 967,
    "11111101111010": 335,
    "11111101111011": 126,
    "1111110111110": 212,
    "1111110111111": 213,
    "1111111000": 319,
    "1111111001": 318,
    "11111110100": 873,
    "111111101010": 746,
    "1111111010110": 336,
    "11111110101110": 817,
    "11111110101111": 816,
    "111111101100": 858,
    "111111101101": 857,
    "111111101110": 546,
    "111111101111": 547,
    "1111111100": 622,
    "11111111010": 300,
    "111111110110": 776,
    "1111111101110": 536,
    "11111111011110": 587,
    "11111111011111": 670,
    "1111111110": 871,
    "111111111100": 315,
    "111111111101": 316,
    "111111111110": 592,
    "1111111111110": 709,
    "1111111111111": 805
}